## Importar librerías

In [1]:
import pandas as pd
import numpy as np

In [2]:
dataset2 = pd.read_csv('datasets/world_cup_2018_stats.csv')
dataset2.sample(10)

,Game,Group,Team,Opponent,Home/Away,Score,WDL,Pens?,Goals For,Goals Against,...,Passes Completed,Distance Covered km,Balls recovered,Tackles,Blocks,Clearances,Yellow cards,Red Cards,Second Yellow Card leading to Red Card,Fouls Committed
121,61,Semi-finals,Belgium,France,away,1-0,L,NaN,0,1,...,565,102,34,16,6,14,3,0,0,16
33,17,A,Egypt,Russia,away,3-1,L,NaN,1,3,...,356,110,41,11,3,29,1,0,0,10
81,41,F,Germany,Korea Republic,away,2-0,L,NaN,0,2,...,635,115,39,9,1,10,0,0,0,7
65,33,A,Russia,Uruguay,away,3-0,L,NaN,0,3,...,296,98,32,15,4,20,1,0,1,18
28,15,H,Colombia,Japan,home,1-2,L,NaN,1,2,...,290,93,40,15,3,22,2,1,0,15
6,4,B,Portugal,Spain,home,3-3,D,NaN,3,3,...,320,102,36,8,2,17,1,0,0,12
2,2,A,Egypt,Uruguay,home,0-1,L,NaN,0,1,...,308,112,57,12,4,32,2,0,0,12
30,16,H,Poland,Senegal,home,1-2,L,NaN,1,2,...,483,110,43,11,2,23,1,0,0,8
120,61,Semi-finals,France,Belgium,home,1-0,W,NaN,1,0,...,294,102,44,16,1,30,2,0,0,6
64,33,A,Uruguay,Russia,home,3-0,W,NaN,3,0,...,431,101,34,10,1,13,1,0,0,17

In [6]:
dataset2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 128 entries, 0 to 127
Data columns (total 32 columns):
Game                                      128 non-null int64
Group                                     128 non-null object
Team                                      128 non-null object
Opponent                                  128 non-null object
Home/Away                                 128 non-null object
Score                                     128 non-null object
WDL                                       128 non-null object
Pens?                                     8 non-null object
Goals For                                 128 non-null int64
Goals Against                             128 non-null int64
Pen Shootout For                          8 non-null float64
Pen Shootout Against                      8 non-null float64
Attempts                                  128 non-null int64
On-Target                                 128 non-null int64
Off-Target                                128 non-null int64
Blocked                                   128 non-null int64
Woodwork                                  128 non-null int64
Corners                                   128 non-null int64
Offsides                                  128 non-null int64
Ball possession %                         128 non-null int64
Pass Accuracy %                           128 non-null int64
Passes                                    128 non-null int64
Passes Completed                          128 non-null int64
Distance Covered km                       128 non-null int64
Balls recovered                           128 non-null int64
Tackles                                   128 non-null int64
Blocks                                    128 non-null int64
Clearances                                128 non-null int64
Yellow cards                              128 non-null int64
Red Cards                                 128 non-null int64
Second Yellow Card leading to Red Card    128 non-null int64
Fouls Committed                           128 non-null int64
dtypes: float64(2), int64(23), object(7)
memory usage: 32.1+ KB

## Leer Dataset

 Leer Dataset con pandas (tip: pd.read_csv).

In [3]:
#Ruta donde se va a leer el dataset
path= 'Datasets/nombres-2010-2014.csv'
#Se le asigna a una variable de python el dataset por medio de la funcion de Pandas "read_csv()"
dataset= pd.read_csv(path)

Pantallazo general: columnas, índices y memoria

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 871494 entries, 0 to 871493
Data columns (total 3 columns):
nombre      871494 non-null object
cantidad    871494 non-null int64
anio        871494 non-null int64
dtypes: int64(2), object(1)
memory usage: 19.9+ MB

### Primera exploración del dataset con pandas.
1. Mostrar las primeras 4 filas del dataset.

In [5]:
dataset.head(4)

     nombre  cantidad  anio
0  Benjamin      2986  2010
1     Sofia      2252  2010
2  Bautista      2176  2010
3   Joaquín      2111  2010

## Columnas del Dataset

2. ¿Cuáles son las dimensiones del Dataset?

In [6]:
dataset.shape

(871494, 3)

3. ¿Cuántas columnas tiene el dataset? ¿ qué nombres tienen?

In [7]:
dataset.shape[1]

3

In [8]:
dataset.columns

Index(['nombre', 'cantidad', 'anio'], dtype='object')

In [9]:
list(dataset.columns)

['nombre', 'cantidad', 'anio']

4. ¿Cuántas instancias tiene el data set?

In [11]:
dataset.shape[0]

871494

5. mostrar las ultimas tres instancias

In [12]:
dataset.tail(3)

                  nombre  cantidad  anio
871491  Yanira Valentina         1  2014
871492      Angie Ainara         1  2014
871493    Elias Hernando         1  2014

   Tenemos **871.494 Filas** y **3 Columnas**

6. ¿Qué tipos de datos tienen las columnas?

In [13]:
dataset.dtypes

nombre      object
cantidad     int64
anio         int64
dtype: object

7. ¿Cuántos Null por columna tenemos? Contar los datos null en cada columna

In [8]:
dataset.isnull().any()

nombre      False
cantidad    False
anio        False
dtype: bool

In [15]:
dataset.isnull().sum()

nombre      0
cantidad    0
anio        0
dtype: int64

8. ¿Cuántos Nombres únicos tenemos? ( usar len() y unique() )

In [16]:
list(dataset['nombre'].unique())
len(dataset['nombre'].unique())

593141

9. ¿Cuáles años tenemos? y ¿Cuántos nombres por año tenemos?

In [10]:
dataset['anio'].unique()

array([2010, 2011, 2012, 2013, 2014], dtype=int64)

In [9]:
len(dataset['anio'].unique())

5

In [19]:
dataset.groupby('anio')['nombre'].count()

anio
2010    135000
2011    119431
2012    203486
2013    204470
2014    209107
Name: nombre, dtype: int64

10. Cuáles fueron los 5 nombres que más se usaron?

In [11]:
dataset[['nombre','cantidad']].groupby('nombre').sum().sort_values(by='cantidad', ascending=False).head(10)

              cantidad
nombre
Benjamin         19491
Martina          14068
Isabella         13245
Bautista         12618
Catalina         12376
Santino          11966
Juan Ignacio     10643
Valentino        10560
Felipe           10277
Mateo            10244

11. Por año cuáles fueron los 5 nombres que más se usaron?

In [21]:
lista_años = dataset.anio.unique() # análogo a dataset['anio'].unique() y aclaración
lista_años

array([2010, 2011, 2012, 2013, 2014], dtype=int64)

In [22]:
dataset.set_index(['nombre']).head()

              cantidad  anio
nombre
Benjamin          2986  2010
Sofia             2252  2010
Bautista          2176  2010
Joaquín           2111  2010
Juan Ignacio      2039  2010

La función groupby () devuelve un objeto GroupBy, pero esencialmente describe cómo se dividieron las filas del conjunto de datos original. La variable .grupo de objeto GroupBy es un diccionario cuyas claves son los grupos únicos computados y los valores correspondientes son las etiquetas de eje que pertenecen a cada grupo.

https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/

In [23]:
dataset.groupby('anio')['cantidad'].nlargest(5).reset_index() # porque usar el nombre como indice

    anio  level_1  cantidad
0   2010        0      2986
1   2010        1      2252
2   2010        2      2176
3   2010        3      2111
4   2010        4      2039
5   2011   135000      2535
6   2011   135001      1870
7   2011   135002      1825
8   2011   135003      1817
9   2011   135004      1782
10  2012   254431      4724
11  2012   254432      3392
12  2012   254433      3138
13  2012   254434      3130
14  2012   254435      3024
15  2013   457917      4960
16  2013   457918      3587
17  2013   457919      3532
18  2013   457920      3215
19  2013   457921      2934
20  2014   662387      4286
21  2014   662388      3563
22  2014   662389      3546
23  2014   662390      2868
24  2014   662391      2820

In [24]:
dataset.set_index(['nombre']).groupby('anio')['cantidad'].nlargest(5).reset_index() # haces el reset indice para que quede ordenado

    anio        nombre  cantidad
0   2010      Benjamin      2986
1   2010         Sofia      2252
2   2010      Bautista      2176
3   2010       Joaquín      2111
4   2010  Juan Ignacio      2039
5   2011      Benjamin      2535
6   2011         Sofia      1870
7   2011       Joaquin      1825
8   2011       Martina      1817
9   2011      Bautista      1782
10  2012      Benjamin      4724
11  2012      Isabella      3392
12  2012       Joaquin      3138
13  2012       Martina      3130
14  2012         Sofía      3024
15  2013      Benjamin      4960
16  2013      Isabella      3587
17  2013       Martina      3532
18  2013       Santino      3215
19  2013      Catalina      2934
20  2014      Benjamin      4286
21  2014       Martina      3563
22  2014      Isabella      3546
23  2014      Catalina      2868
24  2014      Bautista      2820

*12. Buscar 4 nombres de compañeros y contar la cantidad de casos totales.*

In [25]:
nombres_compañeros=['Martina','Facundo','Isabella','Veronica']
dataset.loc[dataset.nombre.isin(nombres_compañeros), ['nombre', 'cantidad']].groupby('nombre').sum().sort_values(by='cantidad', ascending=False)

          cantidad
nombre
Martina      14068
Isabella     13245
Facundo       4794
Veronica        89

*13. Buscar 5 nombres de compañeros y contar la cantidad de casos totales por año.*

In [26]:
nombres_compañeros=['Javier','Marcos','Cristian','Jeronimo','Ernesto']
dataset.loc[dataset.nombre.isin(nombres_compañeros)].sort_values(by=['anio', 'nombre'],ascending=True).iloc[:, [2,0, 1]]# iloc es para ordenar las columnas

        anio    nombre  cantidad
494     2010  Cristian        96
3223    2010   Ernesto        21
712     2010    Javier        72
204     2010  Jeronimo       192
182     2010    Marcos       213
135633  2011  Cristian        63
137090  2011   Ernesto        24
135836  2011    Javier        50
135224  2011    Marcos       144
255592  2012  Cristian        84
258462  2012   Ernesto        29
255952  2012    Javier        67
254660  2012  Jeronimo       289
254692  2012    Marcos       257
459172  2013  Cristian        72
462262  2013   Ernesto        25
459473  2013    Javier        60
458165  2013  Jeronimo       257
458246  2013    Marcos       197
664074  2014  Cristian        55
665033  2014   Ernesto        38
663685  2014    Javier        67
662606  2014  Jeronimo       270
662746  2014    Marcos       185

*14. Hacer una tabla que muestre por año la cantidad de veces que apareció un nombre.*

In [12]:
dataset.pivot_table(values='cantidad',index=['nombre'],columns=['anio']).head()
#dataset.pivot_table(values='cantidad',index=['nombre'],columns=['anio'])

anio                       2010  2011  2012  2013  2014
nombre
        Melody Antonella    NaN   NaN   NaN   NaN   1.0
      Ian                   NaN   NaN   1.0   NaN   NaN
      Ludmila    Victoria   NaN   NaN   1.0   NaN   NaN
      Mia                   1.0   NaN   NaN   NaN   NaN
      Teo                   NaN   2.0   NaN   NaN   NaN

*15. Separar por año (2011,2012,2013,2014) los grupos y responder:*

 ¿Cuántos nombres únicos hay en el año que les tocó? ¿Cuántos nombres únicos hay en el total del dataset?,
 
 Comparar los nombres en el año que les tocó y los del dataset en general y mostrar los que NO APARECEN en el año que les tocó.

In [13]:
nombres_2011=dataset.loc[dataset['anio']==2011]
print(len(nombres_2011['nombre'].unique()))

119431

In [14]:
nombres_2011.head(10)

              nombre  cantidad  anio
135000      Benjamin      2535  2011
135001         Sofia      1870  2011
135002       Joaquin      1825  2011
135003       Martina      1817  2011
135004      Bautista      1782  2011
135005      Catalina      1665  2011
135006       Santino      1607  2011
135007      Santiago      1604  2011
135008  Juan Ignacio      1514  2011
135009     Valentina      1502  2011

In [15]:
nombres_unicos =dataset['nombre'].unique()
print(len(nombres_unicos))
# nombres_unicos

593141

In [16]:
print(len(dataset['nombre'].unique())-len(nombres_2011['nombre'].unique()))

473710

In [17]:
dataset[~dataset['nombre'].isin(nombres_2011['nombre'])] # mostrar los que NO APARECEN en el año que les tocó.
# dataset[np.logical_not(dataset['nombre'].isin(nombres_2011['nombre']))] # otra opcion

                          nombre  cantidad  anio
3                        Joaquín      2111  2010
13                       Agustín      1341  2010
15                         Tomàs      1315  2010
23                        Lucía       1101  2010
30                          Mia        965  2010
48                        OLIVIA       686  2010
63                        Martín       530  2010
74                    Mia Jazmín       446  2010
96                       Micaela       368  2010
100                          Zoe       353  2010
106                Tomas Agustin       328  2010
120              Lautaro Agustin       306  2010
123                    Maria Pia       291  2010
124              Matías Ezequiel       290  2010
132             Santiago Agustín       266  2010
141                          Ana       259  2010
142               Juan Francisco       257  2010
167                         León       223  2010
171                        Rocio       220  2010
174                       Ema          218  2010
180                 Sofía Jazmín       214  2010
183                Angel Gabriel       212  2010
187             Joaquin Ezequiel       205  2010
188                        Jonas       205  2010
192                    Ana Lucia       200  2010
197           BENJAMIN ALEJANDRO       197  2010
200               Matias Nicolas       195  2010
204                     Jeronimo       192  2010
209             Agustín Ezequiel       189  2010
218                         Luz        182  2010
...                          ...       ...   ...
871461        Thiago Romeo Josue         1  2014
871462            Gaston Claudio         1  2014
871463     Gonzalo Marcos Damián         1  2014
871464    Octavio Pedro Valentin         1  2014
871465  Brittany Shamyra Xiomara         1  2014
871466              Yago Caetano         1  2014
871467           Olga Maria Jose         1  2014
871468          Yobana Alejandra         1  2014
871469             Wendy Leticia         1  2014
871470            Erick Bladimir         1  2014
871471             Andrea Paloma         1  2014
871472                Noah Abril         1  2014
871474        Emilce Ivana Itati         1  2014
871475             Gimena Mariam         1  2014
871476        Rubí Ariana Mailén         1  2014
871477        Brandon Yamir Arón         1  2014
871478                Nailen Sol         1  2014
871480             Anabella Jaia         1  2014
871481              Johann Uriel         1  2014
871482               Pedro Samir         1  2014
871483            Leslie Aynelen         1  2014
871484               Etan Isaías         1  2014
871486      Angel Yoshi Gregorio         1  2014
871487  Daniela Jesica Florencia         1  2014
871488   Génesis Maité Guadalupe         1  2014
871489              Leire Jasmin         1  2014
871490    Isaias Sebastian Ariel         1  2014
871491          Yanira Valentina         1  2014
871492              Angie Ainara         1  2014
871493            Elias Hernando         1  2014

[581818 rows x 3 columns]

*16. Hacer una tabla que muestre las 4 primeras instancias de la tabla original.*

In [18]:
nombres_2011_subset=nombres_2011.copy()
nombres_2011_subset=nombres_2011_subset.iloc[0:4,:]
# nombres_2011_subset=nombres_2011_subset.set_index([pd.Index([1, 2, 3, 4])
nombres_2011_subset.head()

          nombre  cantidad  anio
135000  Benjamin      2535  2011
135001     Sofia      1870  2011
135002   Joaquin      1825  2011
135003   Martina      1817  2011

*17. Hacer un subset de los tres primeros nombres*

Vamos a ver la diferencia entre loc y iloc

In [19]:
nombres_2011_subset.reset_index(inplace=True) # inplace = true hace la funcion en el mismo dataframe
nombres_2011_subset.head()

    index    nombre  cantidad  anio
0  135000  Benjamin      2535  2011
1  135001     Sofia      1870  2011
2  135002   Joaquin      1825  2011
3  135003   Martina      1817  2011

In [20]:
nombres_2011_subset.drop(['index'],axis=1,inplace=True)
nombres_2011_subset.head()

     nombre  cantidad  anio
0  Benjamin      2535  2011
1     Sofia      1870  2011
2   Joaquin      1825  2011
3   Martina      1817  2011

In [21]:
nombres_2011_subset['Indice']=[1,2,3,4]
# new_index=[1,2,3,4]

In [22]:
nombres_2011_subset.head()

     nombre  cantidad  anio  Indice
0  Benjamin      2535  2011       1
1     Sofia      1870  2011       2
2   Joaquin      1825  2011       3
3   Martina      1817  2011       4

In [23]:
nombres_2011_subset.set_index('Indice', inplace=True)

In [31]:
nombres_2011_subset.iloc[1:2] #índice implícito

       nombre  cantidad  anio
Indice
2       Sofia      1870  2011

In [30]:
nombres_2011_subset.loc[1:2] #índice explícito

          nombre  cantidad  anio
Indice
1       Benjamin      2535  2011
2          Sofia      1870  2011

**Nota: Recuerden que su trabajo es Darle valor a los datos**